{
  "architectures": [
    "ElectraForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 128,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "\uae30\uc068",
    "1": "\uc124\ub818",
    "2": "\uc548\uc815",
    "3": "\uc11c\uc6b4",
    "4": "\uc9dc\uc99d",
    "5": "\uac71\uc815",
    "6": "\uc911\ub9bd",
    "7": "\uc720\uba38",
    "8": "\ud6c4\ud68c",
    "9": "\uc2ac\ud514"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "\uac71\uc815": 5,
    "\uae30\uc068": 0,
    "\uc11c\uc6b4": 3,
    "\uc124\ub818": 1,
    "\uc2ac\ud514": 9,
    "\uc548\uc815": 2,
    "\uc720\uba38": 7,
    "\uc911\ub9bd": 6,
    "\uc9dc\uc99d": 4,
    "\ud6c4\ud68c": 8
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 4,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "tokenizer_class": "BertTokenizer",
  "transformers_version": "4.56.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 54345
}
